"""Логирование уроков."""

# 31.12.24
#
# 1. Зарегистрировал аккаунты для обучения (работы).
# 2. Установил программы для обучения (работы).
# 3. Присоединился к команде Senatorov.
# 4. Создал свою ветку на ГитХаб репозитории команды Senatorov.
# 5. Клонировал ГитХаб репозиторий команды Senatorov на мой локальный компьютер.
# 6. Установил линтеры на локальную копию репозитория команды Senatorov.
# 7. Перенёс все необходимые файлы и папки с моего старого репозитория.
# 8. Оформил коммит по подготовке свой ветки к работе. 

# 25.01.25
#
# 1. Проверено текущее состояния обучения:
# * выполнен первый issue;
# * по академической теории дошёл до дисперсии дискретной случайной величины.
# 2. Проверен вариант прохождения курса обучения по ресурсам, которые были рекомендованы ранее:
# * учебник Гмурмана В.Е.;
# * учебник Кремера Н.Ш.;
# * видеоматериалы Khan Academy;
# * курсы Stepik;
# * курсы Lektorium;
# * задачники по теории вероятностей.
# 3. Рекомендовано выполнить оставшиеся issues и готовиться к экзамену по теории вероятностей.

# 28.02.25
#
# 1. Проведен экзаменационный контроль по теории вероятности.
# 2. По результатам контроля экзамен не сдан.
# 3. В связи с этим выполнена корректировка дальнейшего курса обучения:
# вместо академического варианта обучения будет изучаться прикладная статистика на Пайтон.

# 07.03.25
#
# 1. Участвовал в групповом уроке по теории вероятности.
# 2. Пройдены следующие вопросы:
# * Случайная величина;
# * Функция распределения;
# * Полигон;
# * Математическое ожидание;
# * Дисперсия;
# * Среднеквадратичная отклонение;
# * Коэффициент вариации;
# * Мода;
# * Медиана;
# * Коэффициент ассиметрии;
# * Эксцесс;
# * Центральные моменты.
# 3. Домашнее задание: завершить выполнение issues, а также научиться вычислять 
# центральные моменты через формулы (не пользуясь таблицами).
